---
type: RebarConstrainedHandle
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 9
tags: [revit-api, class]
---

# RebarConstrainedHandle

`Autodesk.Revit.DB.Structure.RebarConstrainedHandle` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCustomHandleTag | 2018 | `public int GetCustomHandleTag ()` |
| Method | GetEdgeNumber | 2014 | `public int GetEdgeNumber ()` |
| Method | GetHandleName | 2018 | `public string GetHandleName ()` |
| Method | GetHandleType | 2014 | `public RebarHandleType GetHandleType ()` |
| Method | IsCustomHandle | 2018 | `public bool IsCustomHandle ()` |
| Method | IsEdgeHandle | 2014 | `public bool IsEdgeHandle ()` |
| Method | IsValid | 2014 | `public bool IsValid ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |